; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))

  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (and (calibrated ?i)))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (and (have_image ?d ?m))))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	satellite4 - satellite
	instrument7 - instrument
	instrument8 - instrument
	instrument9 - instrument
	spectrograph1 - mode
	thermograph0 - mode
	image3 - mode
	thermograph2 - mode
	Star3 - direction
	Star1 - direction
	Star0 - direction
	GroundStation2 - direction
	Phenomenon4 - direction
	Planet5 - direction
	Star6 - direction
	Planet7 - direction
	Planet8 - direction
	Planet9 - direction
	Star10 - direction
	Phenomenon11 - direction
	Planet12 - direction
	Star13 - direction
	Phenomenon14 - direction
	Planet15 - direction
	Star16 - direction
	Planet17 - direction
	Phenomenon18 - direction
	Star19 - direction
	Phenomenon20 - direction
	Star21 - direction
	Planet22 - direction
	Star23 - direction
	Planet24 - direction
)
(:init
	(supports instrument0 spectrograph1)
	(supports instrument0 image3)
	(calibration_target instrument0 Star1)
	(supports instrument1 thermograph2)
	(supports instrument1 spectrograph1)
	(supports instrument1 thermograph0)
	(calibration_target instrument1 Star1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star10)
	(supports instrument2 image3)
	(calibration_target instrument2 Star3)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star1)
	(supports instrument3 thermograph2)
	(supports instrument3 thermograph0)
	(calibration_target instrument3 Star0)
	(supports instrument4 spectrograph1)
	(supports instrument4 thermograph0)
	(calibration_target instrument4 Star0)
	(supports instrument5 thermograph0)
	(calibration_target instrument5 Star0)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star1)
	(supports instrument6 image3)
	(supports instrument6 spectrograph1)
	(supports instrument6 thermograph0)
	(calibration_target instrument6 Star1)
	(on_board instrument6 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star23)
	(supports instrument7 spectrograph1)
	(supports instrument7 image3)
	(supports instrument7 thermograph0)
	(calibration_target instrument7 Star1)
	(supports instrument8 spectrograph1)
	(calibration_target instrument8 Star0)
	(supports instrument9 thermograph2)
	(supports instrument9 image3)
	(supports instrument9 thermograph0)
	(calibration_target instrument9 GroundStation2)
	(on_board instrument7 satellite4)
	(on_board instrument8 satellite4)
	(on_board instrument9 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Planet22)
)
(:goal (and
	(pointing satellite0 Star23)
	(have_image Phenomenon4 thermograph2)
	(have_image Planet5 spectrograph1)
	(have_image Star6 thermograph2)
	(have_image Planet7 spectrograph1)
	(have_image Star10 image3)
	(have_image Phenomenon11 thermograph2)
	(have_image Planet12 thermograph2)
	(have_image Star13 spectrograph1)
	(have_image Phenomenon14 image3)
	(have_image Planet15 thermograph0)
	(have_image Star16 spectrograph1)
	(have_image Planet17 image3)
	(have_image Phenomenon18 spectrograph1)
	(have_image Star19 spectrograph1)
	(have_image Phenomenon20 image3)
	(have_image Star21 spectrograph1)
	(have_image Planet22 thermograph0)
	(have_image Star23 thermograph2)
	(have_image Planet24 image3)
))

)

; plan
1. (switch_on instrument7 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument7)
   goals met: 0 of 20
2. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 20
3. (turn_to satellite4 star1 planet22)
   deleted: (pointing satellite4 planet22)
   added: (pointing satellite4 star1)
   goals met: 0 of 20
4. (calibrate satellite4 instrument7 star1)
   added: (calibrated instrument7)
   goals met: 0 of 20
5. (turn_to satellite4 phenomenon14 star1)
   deleted: (pointing satellite4 star1)
   added: (pointing satellite4 phenomenon14)
   goals met: 0 of 20
6. (take_image satellite4 phenomenon14 instrument7 image3)
   added: (have_image phenomenon14 image3)
   goals met: 1 of 20
7. (turn_to satellite4 phenomenon18 phenomenon14)
   deleted: (pointing satellite4 phenomenon14)
   added: (pointing satellite4 phenomenon18)
   goals met: 1 of 20
8. (take_image satellite4 phenomenon18 instrument7 spectrograph1)
   added: (have_image phenomenon18 spectrograph1)
   goals met: 2 of 20
9. (turn_to satellite4 phenomenon20 phenomenon18)
   deleted: (pointing satellite4 phenomenon18)
   added: (pointing satellite4 phenomenon20)
   goals met: 2 of 20
10. (take_image satellite4 phenomenon20 instrument7 image3)
   added: (have_image phenomenon20 image3)
   goals met: 3 of 20
11. (turn_to satellite4 planet15 phenomenon20)
   deleted: (pointing satellite4 phenomenon20)
   added: (pointing satellite4 planet15)
   goals met: 3 of 20
12. (take_image satellite4 planet15 instrument7 thermograph0)
   added: (have_image planet15 thermograph0)
   goals met: 4 of 20
13. (turn_to satellite4 planet17 planet15)
   deleted: (pointing satellite4 planet15)
   added: (pointing satellite4 planet17)
   goals met: 4 of 20
14. (take_image satellite4 planet17 instrument7 image3)
   added: (have_image planet17 image3)
   goals met: 5 of 20
15. (turn_to satellite4 planet22 planet17)
   deleted: (pointing satellite4 planet17)
   added: (pointing satellite4 planet22)
   goals met: 5 of 20
16. (take_image satellite4 planet22 instrument7 thermograph0)
   added: (have_image planet22 thermograph0)
   goals met: 6 of 20
17. (turn_to satellite4 planet24 planet22)
   deleted: (pointing satellite4 planet22)
   added: (pointing satellite4 planet24)
   goals met: 6 of 20
18. (take_image satellite4 planet24 instrument7 image3)
   added: (have_image planet24 image3)
   goals met: 7 of 20
19. (turn_to satellite4 planet5 planet24)
   deleted: (pointing satellite4 planet24)
   added: (pointing satellite4 planet5)
   goals met: 7 of 20
20. (take_image satellite4 planet5 instrument7 spectrograph1)
   added: (have_image planet5 spectrograph1)
   goals met: 8 of 20
21. (turn_to satellite4 planet7 planet5)
   deleted: (pointing satellite4 planet5)
   added: (pointing satellite4 planet7)
   goals met: 8 of 20
22. (take_image satellite4 planet7 instrument7 spectrograph1)
   added: (have_image planet7 spectrograph1)
   goals met: 9 of 20
23. (turn_to satellite4 star10 planet7)
   deleted: (pointing satellite4 planet7)
   added: (pointing satellite4 star10)
   goals met: 9 of 20
24. (take_image satellite4 star10 instrument7 image3)
   added: (have_image star10 image3)
   goals met: 10 of 20
25. (turn_to satellite4 star13 star10)
   deleted: (pointing satellite4 star10)
   added: (pointing satellite4 star13)
   goals met: 10 of 20
26. (take_image satellite4 star13 instrument7 spectrograph1)
   added: (have_image star13 spectrograph1)
   goals met: 11 of 20
27. (turn_to satellite4 star16 star13)
   deleted: (pointing satellite4 star13)
   added: (pointing satellite4 star16)
   goals met: 11 of 20
28. (take_image satellite4 star16 instrument7 spectrograph1)
   added: (have_image star16 spectrograph1)
   goals met: 12 of 20
29. (turn_to satellite4 star19 star16)
   deleted: (pointing satellite4 star16)
   added: (pointing satellite4 star19)
   goals met: 12 of 20
30. (take_image satellite4 star19 instrument7 spectrograph1)
   added: (have_image star19 spectrograph1)
   goals met: 13 of 20
31. (turn_to satellite4 star21 star19)
   deleted: (pointing satellite4 star19)
   added: (pointing satellite4 star21)
   goals met: 13 of 20
32. (take_image satellite4 star21 instrument7 spectrograph1)
   added: (have_image star21 spectrograph1)
   goals met: 14 of 20
33. (turn_to satellite0 phenomenon11 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 phenomenon11)
   goals met: 14 of 20
34. (turn_to satellite0 star1 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 star1)
   goals met: 14 of 20
35. (calibrate satellite0 instrument1 star1)
   added: (calibrated instrument1)
   goals met: 14 of 20
36. (turn_to satellite0 phenomenon11 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 phenomenon11)
   goals met: 14 of 20
37. (take_image satellite0 phenomenon11 instrument1 thermograph2)
   added: (have_image phenomenon11 thermograph2)
   goals met: 15 of 20
38. (turn_to satellite0 phenomenon4 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 phenomenon4)
   goals met: 15 of 20
39. (take_image satellite0 phenomenon4 instrument1 thermograph2)
   added: (have_image phenomenon4 thermograph2)
   goals met: 16 of 20
40. (turn_to satellite0 planet12 phenomenon4)
   deleted: (pointing satellite0 phenomenon4)
   added: (pointing satellite0 planet12)
   goals met: 16 of 20
41. (take_image satellite0 planet12 instrument1 thermograph2)
   added: (have_image planet12 thermograph2)
   goals met: 17 of 20
42. (turn_to satellite0 star23 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 star23)
   goals met: 18 of 20
43. (take_image satellite0 star23 instrument1 thermograph2)
   added: (have_image star23 thermograph2)
   goals met: 19 of 20
44. (turn_to satellite0 star6 star23)
   deleted: (pointing satellite0 star23)
   added: (pointing satellite0 star6)
   goals met: 18 of 20
45. (take_image satellite0 star6 instrument1 thermograph2)
   added: (have_image star6 thermograph2)
   goals met: 19 of 20
46. (turn_to satellite0 star23 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 star23)
   goals met: 20 of 20
